#include <stdio.h>

int board[5][5];     // 빙고판 숫자
int mark[5][5];      // 체크 여부
int pos[26][2];      // 숫자별 좌표 (1~25)

// 12개 빙고 라인 정의
int bingoLines[12][5][2] = {
    // 가로줄
    {{0,0},{0,1},{0,2},{0,3},{0,4}},
    {{1,0},{1,1},{1,2},{1,3},{1,4}},
    {{2,0},{2,1},{2,2},{2,3},{2,4}},
    {{3,0},{3,1},{3,2},{3,3},{3,4}},
    {{4,0},{4,1},{4,2},{4,3},{4,4}},

    // 세로줄
    {{0,0},{1,0},{2,0},{3,0},{4,0}},
    {{0,1},{1,1},{2,1},{3,1},{4,1}},
    {{0,2},{1,2},{2,2},{3,2},{4,2}},
    {{0,3},{1,3},{2,3},{3,3},{4,3}},
    {{0,4},{1,4},{2,4},{3,4},{4,4}},

    // 대각선
    {{0,0},{1,1},{2,2},{3,3},{4,4}},  // 왼쪽 위 -> 오른쪽 아래
    {{0,4},{1,3},{2,2},{3,1},{4,0}}   // 오른쪽 위 -> 왼쪽 아래
};

int checkBingo() {
    int cnt = 0;

    for (int line = 0; line < 12; line++) { // 12가지 빙고 라인 확인
        int filled = 0;
        for (int k = 0; k < 5; k++) { 
            int r = bingoLines[line][k][0]; 
            int c = bingoLines[line][k][1];
			if (mark[r][c]) filled++; // 12가지 경우 중 체크된 칸 수 세기
        }
		if (filled == 5) { // 해당 라인이 모두 체크되었으면
			cnt++; // 빙고 개수 증가
            if (cnt >= 3) break; 
        }
    }
    return cnt;
}

int main() {
    // 1. 빙고판 입력 + 숫자 위치 저장
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
            scanf("%d", &board[i][j]);
            pos[board[i][j]][0] = i;
            pos[board[i][j]][1] = j;
        }
    }

    // 2. 숫자 25개 불리기
    for (int call = 1; call <= 25; call++) {
        int num;
        scanf("%d", &num);

        // 해당 숫자 좌표 체크
        int r = pos[num][0];
        int c = pos[num][1];
        mark[r][c] = 1;

        // 5번째 숫자부터 빙고 가능성 있음
        if (call >= 5) {
            int bingo = checkBingo();
            if (bingo >= 3) {
                printf("%d\n", call); // 몇 번째에 3빙고가 되었는지 출력
                break;
            }
        }
    }

    return 0;
}
